<?php
/*#####################################################################*|

|  Arab Forums 0.2                                                      |

|  This Script Is Free Software                                         |

|  Programmed By : Aissam Nedjar                                        |

|  facebook : facebook.com/aissam.nedjar.43                             |

|*#####################################################################*/

if(!defined("error_page_arab_forums")){exit(header("location: ../error.php"));}

$group_list = array(

0 => "الزوار" ,

1 => "الأعضاء" ,

2 => "المشرفين" ,

3 => "نواب المراقبين" ,

4 => "المراقبين" ,

5 => "المراقبين العامين" ,

6 => "المدراء" ,

);

$months_list = array(

"1" => "جانفي" , 

"2" => "فيفري" , 

"3" => "مارس" , 

"4" => "أفريل" , 

"5" => "ماي" , 

"6" => "جوان" , 

"7" => "جويلية" , 

"8" => "أوت" , 

"9" => "سبتمبر" , 

"10" => "أكتوبر" , 

"11" => "نوفمبر" , 

"12" => "ديسمبر"

);

$colorn_list = array(

"black" => "نجوم سوداء" ,

"blue" => "نجوم زرقاء" ,

"brown" => "نجوم بنية" ,

"green" => "نجوم خضراء" ,

"orange" => "نجوم برتقالية" ,

"red" => "نجوم حمراء" ,

);

$country_list = array(

"AD" => "أندورا" ,

"AE" => "الإمارات" ,

"AF" => "أفغانستان" ,

"AG" => "أنتيجا وبربودا" ,

"AI" => "أنجيلا" ,

"AL" => "ألبانيا" ,

"AM" => "أرمينيا" ,

"AN" => "جزر الأنتيل" ,

"AO" => "أنغولا" ,

"AQ" => "انتاركتيكا" ,

"AR" => "الأرجنتين" ,

"AS" => "الساموا الأمريكية" ,

"AT" => "النمسا" ,

"AU" => "أستراليا" ,

"AW" => "أروبا" ,

"AZ" => "إذربيجان" ,

"BA" => "البوسنة والهرسك" ,

"BB" => "بربادوس" ,

"BD" => "بنغلادش" ,

"BE" => "بلجيكا" ,

"BF" => "بوركينا فاسو" ,

"BG" => "بلغاريا" ,

"BH" => "البحرين" ,

"BI" => "بوروندي" ,

"BJ" => "بنين" ,

"BM" => "برمودا" ,

"BN" => "بروناي" ,

"BO" => "بوليفيا" ,

"BR" => "البرازيل" ,

"BS" => "البهاما" ,

"BT" => "بوتان" ,

"BV" => "جزيرة بوفيه" ,

"BW" => "بوتسوانا" ,

"BY" => "روسيا البيضاء" ,

"BZ" => "بليز" ,

"CA" => "كندا" ,

"CD" => "جمهورية الكونجو" ,

"CF" => "أفريقيا الوسطى" ,

"CG" => "الكونجو" ,

"CH" => "سويسرا" ,

"CI" => "ساحل العاج" ,

"CK" => "جزر كوك" ,

"CL" => "تشيلي" ,

"CM" => "الكاميرون" ,

"CN" => "الصين" ,

"CO" => "كولمبيا" ,

"CR" => "كوستا ريكا" ,

"CU" => "كوبا" ,

"CV" => "كاب فيردي" ,

"CY" => "قبرص" ,

"CZ" => "التشيك" ,

"DE" => "ألمانيا" ,

"DJ" => "جيبوتي" ,

"DK" => "الدانمارك" ,

"DM" => "دومينيكا" ,

"DO" => "الدومينيكان" ,

"DZ" => "الجزائر" ,

"EC" => "الإكوادور" ,

"EE" => "إستونيا" ,

"EG" => "مصر" ,

"ER" => "إريتريا" ,

"ES" => "أسبانيا" ,

"ET" => "إثيوبيا" ,

"FI" => "فنلندا" ,

"FJ" => "جزر فيجي" ,

"FK" => "جزر الفلكلاند" ,

"FM" => "مايكرونيسيا" ,

"FO" => "جزر فاروه" ,

"FR" => "فرنسا" ,

"GA" => "الجابون" ,

"GB" => "بريطانيا" ,

"GD" => "جرنادا" ,

"GE" => "جورجيا" ,

"GF" => "غيانا الفرنسية" ,

"GH" => "غانا" ,

"GI" => "جبل طارق" ,

"GL" => "جزر جرينلاند" ,

"GM" => "جامبيا" ,

"GN" => "غينيا" ,

"GP" => "جوادلوب" ,

"GQ" => "غينيا الإستوائية" ,

"GR" => "اليونان" ,

"GT" => "جواتيمالا" ,

"GU" => "جوام" ,

"GW" => "جينيا بيساو" ,

"GY" => "غيانا" ,

"HK" => "هونج كونج" ,

"HN" => "الهوندوراس" ,

"HR" => "كرواتيا" ,

"HT" => "هايتي" ,

"HU" => "المجر" ,

"ID" => "إندونيسيا" ,

"IE" => "إيرلندا" ,

"IN" => "الهند" ,

"IQ" => "العراق" ,

"IR" => "إيران" ,

"IS" => "أيسلندا" ,

"IT" => "إيطاليا" ,

"JM" => "جاميكا" ,

"JO" => "الأردن" ,

"JP" => "اليابان" ,

"KE" => "كينيا" ,

"KG" => "كيرجيستان" ,

"KH" => "كمبوديا" ,

"KI" => "كيريباتي" ,

"KM" => "جزر القمر" ,

"KP" => "كوريا الشمالية" ,

"KR" => "كوريا الجنوبية" ,

"KW" => "الكويت" ,

"KY" => "جزر الكايمان" ,

"KZ" => "كازاخستان" ,

"LA" => "لاوس" ,

"LB" => "لبنان" ,

"LC" => "سانت لوسيا" ,

"LI" => "ليشتنشتين" ,

"LK" => "سري لانكا" ,

"LR" => "ليبيريا" ,

"LS" => "ليسوثو" ,

"LT" => "ليثوانيا" ,

"LU" => "لوكسمبرج" ,

"LV" => "لاتفيا" ,

"LY" => "ليبيا" ,

"MA" => "المغرب" ,

"MC" => "موناكو" ,

"MD" => "مولدوفا" ,

"MG" => "مدغشقر" ,

"MH" => "جزر المارشال" ,

"MK" => "مقدونيا" ,

"ML" => "مالي" ,

"MM" => "ميانمار" ,

"MN" => "مونغوليا" ,

"MO" => "ماكاو" ,

"MQ" => "مارتينيك" ,

"MR" => "موريتانيا" ,

"MS" => "مونسرات" ,

"MT" => "مالطة" ,

"MU" => "الموريشيس" ,

"MV" => "جزر المالديف" ,

"MW" => "مالاوي" ,

"MX" => "المكسيك" ,

"MY" => "ماليزيا" ,

"MZ" => "موزمبيق" ,

"NA" => "ناميبيا" ,

"NC" => "كاليدونيا" ,

"NE" => "النيجر" ,

"NG" => "نيجيريا" ,

"NI" => "نيكاراجوا" ,

"NL" => "هولندا" ,

"NO" => "النرويج" ,

"NP" => "النيبال" ,

"NR" => "ناورو" ,

"NU" => "نوي" ,

"NZ" => "نيو زيلندا" ,

"OM" => "عمان" ,

"PA" => "بنما" ,

"PE" => "بيرو" ,

"PF" => "بولينيسيا" ,

"PG" => "بابوا نيو جيني" ,

"PH" => "الفلبين" ,

"PK" => "باكستان" ,

"PL" => "بولندا" ,

"PR" => "بورتو ريكو" ,

"PS" => "فلسطين" ,

"PT" => "البرتغال" ,

"PW" => "بالاو" ,

"PY" => "باراجواي" ,

"QA" => "قطر" ,

"RE" => "جزر الرينيون" ,

"RO" => "رومانيا" ,

"RS" => "صربيا" ,

"RU" => "روسيا" ,

"RW" => "رواندا" ,

"SA" => "السعودية" ,

"SB" => "جزر السولومون" ,

"SC" => "السيشيل" ,

"SD" => "السودان" ,

"SE" => "السويد" ,

"SG" => "سنغافورة" ,

"SI" => "سلوفينيا" ,

"SK" => "سلوفاكيا" ,

"SL" => "سييرا ليون" ,

"SM" => "سان مارينو" ,

"SN" => "السنغال" ,

"SO" => "الصومال" ,

"SR" => "سورينام" ,

"SV" => "السلفادور" ,

"SY" => "سوريا" ,

"SZ" => "سوازيلاند" ,

"TD" => "تشاد" ,

"TG" => "توجو" ,

"TH" => "تايلاند" ,

"TJ" => "تاطجكستان" ,

"TM" => "تركمنستان" ,

"TN" => "تونس" ,

"TO" => "تونجا" ,

"TR" => "تركيا" ,

"TT" => "ترينيداد وتوباجو" ,

"TV" => "توفالو" ,

"TW" => "تايوان" ,

"TZ" => "تنزانيا" ,

"UA" => "أوكرانيا" ,

"UG" => "أوغندا" ,

"US" => "أمريكا" ,

"UY" => "أوروجواي" ,

"UZ" => "أزبكستان" ,

"VA" => "امارة فاتيكان" ,

"VE" => "فنزويلا" ,

"VN" => "فيتنام" ,

"VU" => "فاناتو" ,

"WS" => "ساموا" ,

"WA" => "ويلز" ,

"YU" => "يوغوسلافيا" ,

"YE" => "اليمن" ,

"ZA" => "جنوب أفريقيا" ,

"ZM" => "زامبيا" ,

"ZW" => "زمبابوي" ,

);

$count_list = array(

"--" => "غير معروف" ,

"LH" => "سيرفر شخصي" ,

"ET" => "إثيوبيا" ,

"AZ" => "إذربيجان" ,

"AM" => "أرمينيا" ,

"AW" => "أروبا" ,

"ER" => "إريتريا" ,

"UZ" => "أزبكستان" ,

"ES" => "أسبانيا" ,

"AU" => "أستراليا" ,

"EE" => "إستونيا" ,

"SS" => "إسكوتلندا" ,

"AF" => "أفغانستان" ,

"AL" => "ألبانيا" ,

"DE" => "ألمانيا" ,

"DD" => "ألمانيا الشرقية" ,

"AG" => "أنتيجا وبربودا" ,

"EN" => "إنجلترا" ,

"AI" => "أنجيلا" ,

"AD" => "أندورا" ,

"ID" => "إندونيسيا" ,

"AO" => "أنغولا" ,

"UY" => "أوروجواي" ,

"UG" => "أوغندا" ,

"UA" => "أوكرانيا" ,

"IR" => "إيران" ,

"IE" => "إيرلندا" ,

"ND" => "إيرلندا الشمالية" ,

"IS" => "أيسلندا" ,

"IT" => "إيطاليا" ,

"ZS" => "الإتحاد السوفيتي" ,

"AR" => "الأرجنتين" ,

"JO" => "الأردن" ,

"EC" => "الإكوادور" ,

"AE" => "الإمارات" ,

"BH" => "البحرين" ,

"BR" => "البرازيل" ,

"PT" => "البرتغال" ,

"BS" => "البهاما" ,

"BA" => "البوسنة والهرسك" ,

"CZ" => "التشيك" ,

"GA" => "الجابون" ,

"DZ" => "الجزائر" ,

"DK" => "الدانمارك" ,

"DO" => "الدومينيكان" ,

"AS" => "الساموا الأمريكية" ,

"SA" => "السعودية" ,

"SV" => "السلفادور" ,

"SN" => "السنغال" ,

"SD" => "السودان" ,

"SE" => "السويد" ,

"SC" => "السيشيل" ,

"SO" => "الصومال" ,

"CN" => "الصين" ,

"IQ" => "العراق" ,

"PH" => "الفلبين" ,

"CM" => "الكاميرون" ,

"CG" => "الكونجو" ,

"KW" => "الكويت" ,

"HU" => "المجر" ,

"MA" => "المغرب" ,

"MX" => "المكسيك" ,

"MU" => "الموريشيس" ,

"NO" => "النرويج" ,

"AT" => "النمسا" ,

"NP" => "النيبال" ,

"NE" => "النيجر" ,

"IN" => "الهند" ,

"HN" => "الهوندوراس" ,

"US" => "الولايات المتحدة الأمريكية" ,

"JP" => "اليابان" ,

"YE" => "اليمن" ,

"GR" => "اليونان" ,

"AQ" => "انتاركتيكا" ,

"PG" => "بابوا نيو جيني" ,

"PY" => "باراجواي" ,

"PK" => "باكستان" ,

"PW" => "بالاو" ,

"BB" => "بربادوس" ,

"BM" => "برمودا" ,

"BN" => "بروناي دار السلام" ,

"GB" => "بريطانيا" ,

"BE" => "بلجيكا" ,

"BG" => "بلغاريا" ,

"BZ" => "بليز" ,

"BD" => "بنغلادش" ,

"PA" => "بنما" ,

"BJ" => "بنين" ,

"BT" => "بوتان" ,

"BW" => "بوتسوانا" ,

"PR" => "بورتو ريكو" ,

"BF" => "بوركينا فاسو" ,

"BI" => "بوروندي" ,

"PL" => "بولندا" ,

"BO" => "بوليفيا" ,

"PF" => "بولينيسيا الفرنسية" ,

"PE" => "بيرو" ,

"TJ" => "تاطجكستان" ,

"TH" => "تايلاند" ,

"TW" => "تايوان" ,

"TM" => "تركمنستان" ,

"TR" => "تركيا" ,

"TT" => "ترينيداد وتوباجو" ,

"TD" => "تشاد" ,

"CE" => "تشيكوسلوفاكيا" ,

"CL" => "تشيلي" ,

"TZ" => "تنزانيا" ,

"TG" => "توجو" ,

"TV" => "توفالو" ,

"TO" => "تونجا" ,

"TN" => "تونس" ,

"TP" => "تيمور الشرقية" ,

"GM" => "جامبيا" ,

"JM" => "جاميكا" ,

"GI" => "جبل طارق" ,

"GD" => "جرنادا" ,

"AN" => "جزر الأنتيل" ,

"RE" => "جزر الرينيون" ,

"SB" => "جزر السولومون" ,

"FK" => "جزر الفلكلاند" ,

"KM" => "جزر القمر" ,

"KY" => "جزر الكايمان" ,

"CC" => "جزر الكوكوس" ,

"MH" => "جزر المارشال" ,

"MV" => "جزر المالديف" ,

"GL" => "جزر جرينلاند" ,

"FO" => "جزر فاروه" ,

"FJ" => "جزر فيجي" ,

"CK" => "جزر كوك" ,

"BV" => "جزيرة بوفيه" ,

"CF" => "جمهورية أفريقيا الوسطى" ,

"CD" => "جمهورية الكونجو" ,

"ZA" => "جنوب أفريقيا" ,

"GT" => "جواتيمالا" ,

"GP" => "جوادلوب" ,

"GU" => "جوام" ,

"GE" => "جورجيا" ,

"DJ" => "جيبوتي" ,

"GW" => "جينيا بيساو" ,

"DM" => "دومينيكا" ,

"RW" => "رواندا" ,

"RU" => "روسيا" ,

"BY" => "روسيا البيضاء" ,

"RO" => "رومانيا" ,

"ZM" => "زامبيا" ,

"ZW" => "زمبابوي" ,

"CI" => "ساحل العاج" ,

"WS" => "ساموا" ,

"SM" => "سان مارينو" ,

"LC" => "سانت لوسيا" ,

"LK" => "سري لانكا" ,

"SK" => "سلوفاكيا" ,

"SI" => "سلوفينيا" ,

"SG" => "سنغافورة" ,

"SZ" => "سوازيلاند" ,

"SY" => "سوريا" ,

"SR" => "سورينام" ,

"CH" => "سويسرا" ,

"SL" => "سييرا ليون" ,

"SX" => "صربيا" ,

"OM" => "عمان" ,

"GH" => "غانا" ,

"GY" => "غيانا" ,

"GF" => "غيانا الفرنسية" ,

"GN" => "غينيا" ,

"GQ" => "غينيا الإستوائية" ,

"VU" => "فاناتو" ,

"FR" => "فرنسا" ,

"PS" => "فلسطين" ,

"VE" => "فنزويلا" ,

"FI" => "فنلندا" ,

"VN" => "فيتنام" ,

"CY" => "قبرص" ,

"QA" => "قطر" ,

"CV" => "كاب فيردي" ,

"KZ" => "كازاخستان" ,

"NC" => "كاليدونيا الجديدة" ,

"HR" => "كرواتيا" ,

"KH" => "كمبوديا" ,

"CA" => "كندا" ,

"CU" => "كوبا" ,

"KR" => "كوريا الجنوبية" ,

"KP" => "كوريا الشمالية" ,

"CR" => "كوستا ريكا" ,

"CO" => "كولمبيا" ,

"KG" => "كيرجيستان" ,

"KI" => "كيريباتي" ,

"KE" => "كينيا" ,

"LV" => "لاتفيا" ,

"LA" => "لاوس" ,

"LB" => "لبنان" ,

"LU" => "لوكسمبرج" ,

"LY" => "ليبيا" ,

"LR" => "ليبيريا" ,

"LT" => "ليثوانيا" ,

"LS" => "ليسوثو" ,

"LI" => "ليشتنشتين" ,

"MQ" => "مارتينيك" ,

"MO" => "ماكاو" ,

"MW" => "مالاوي" ,

"MT" => "مالطة" ,

"ML" => "مالي" ,

"MY" => "ماليزيا" ,

"FM" => "مايكرونيسيا" ,

"MG" => "مدغشقر" ,

"EG" => "مصر" ,

"MK" => "مقدونيا" ,

"MR" => "موريتانيا" ,

"MZ" => "موزمبيق" ,

"MD" => "مولدوفا" ,

"MC" => "موناكو" ,

"MS" => "مونسرات" ,

"MN" => "مونغوليا" ,

"MM" => "ميانمار" ,

"NA" => "ناميبيا" ,

"NR" => "ناورو" ,

"NU" => "نوي" ,

"NG" => "نيجيريا" ,

"NI" => "نيكاراجوا" ,

"NZ" => "نيو زيلندا" ,

"HT" => "هايتي" ,

"NL" => "هولندا" ,

"HK" => "هونج كونج" ,

"WA" => "ويلز" ,

"YU" => "يوغوسلافيا" ,

"IL" => "إسرائيل" ,

);

$titleold_list = array(

1 => "مشرف سابق / مشرفة سابقة" ,

2 => "نائب مراقب سابق / نائبة مراقب سابقة" ,

3 => "مراقب سابق / مراقبة سابقة" ,

4 => "مراقب عام سابق / مراقبة عام سابقة" ,

5 => "مدير سابق / مديرة سابقة" ,

6 => "عضو شرفي / عضوة شرفية" ,

7 => "عضو صديق / عضوة صديقة" ,

);

$sex1titleold_list = array(

1 => "مشرف سابق" ,

2 => "نائب مراقب سابق" ,

3 => "مراقب سابق" ,

4 => "مراقب عام سابق" ,

5 => "مدير سابق" ,

6 => "عضو شرفي" ,

7 => "عضو صديق" ,

);

$sex2titleold_list = array(

1 => "مشرفة سابقة" ,

2 => "نائبة مراقب سابقة" ,

3 => "مراقبة سابقة" ,

4 => "مراقبة عام سابقة" ,

5 => "مديرة سابقة" ,

6 => "عضوة شرفية" ,

7 => "عضوة صديقة" ,

);

$option_list = array(

"edit" => "تعديل" ,

"wait" => "الموافقة على" ,

"lock" => "غلق" ,

"nolock" => "فتح" ,

"hid" => "إخفاء" ,

"nohid" => "إظهار" ,

"stiky" => "تثبيث" ,

"nostiky" => "إزالة تثبيث" ,

"top0" => "إزالة تمييز" ,

"top1" => "تمييز بنجمة" ,

"top2" => "تمييز بميدالية" ,

"link0" => "إزالة من الوصلات" ,

"link1" => "جعل كوصلة عادية" ,

"link2" => "جعل كوصلة أساسية" ,

"delete" => "حذف" ,

"nodelete" => "إرجاع" ,

"top" => "تمييز" ,

"notop" => "إزالة تمييز" ,

"img" => "إخفاء صور" ,

"noimg" => "إظهار صور" ,

"url" => "إخفاء روابط" ,

"nourl" => "إظهار روابط" ,

"option" => "تعديل خيارات" ,

"lock1" => "غلق" ,

"nolock1" => "فتح" ,

"lock2" => "تجميد" ,

"nolock2" => "إزالة تجميد" ,

);

$hala_list = array(

"1" => "أعزب / عازبة" ,

"2" => "مرتبط / مرتبطة" ,

"3" => "مخطوب / مخطوبة" ,

"4" => "متزوج / متزوجة" ,

"5" => "الأمر معقد" ,

"6" => "في علاقة مفتوحة" ,

"7" => "أرمل / أرملة" ,

"8" => "منفصل / منفصلة" ,

"9" => "مطلق / مطلقة"

);

$halasex1_list = array(

"1" => "أعزب" ,

"2" => "مرتبط" ,

"3" => "مخطوب" ,

"4" => "متزوج" ,

"5" => "الأمر معقد" ,

"6" => "في علاقة مفتوحة" ,

"7" => "أرمل" ,

"8" => "منفصل" ,

"9" => "مطلق"

);

$halasex2_list = array(

"1" => "عازبة" ,

"2" => "مرتبطة" ,

"3" => "ممخطوبة" ,

"4" => "متزوجة" ,

"5" => "الأمر معقد" ,

"6" => "في علاقة مفتوحة" ,

"7" => "أرملة" ,

"8" => "منفصلة" ,

"9" => "مطلقة"

);

$notify_list = array(

"1" => "الموضوع أو المشاركة أو الرسالة تحتوي على صور غير لائقة" ,

"2" => "الموضوع أو المشاركة أو الرسالة تحتوي على كلام غير لائق" ,

"3" => "الموضوع أو المشاركة أو الرسالة تحتوي على شتم أو تهجم" ,

"4" => "الموضوع أو المشاركة أو الرسالة تحتوي على إشهار" ,

"5" => "الموضوع أو المشاركة أو الرسالة تحتوي على أشياء أخرى"

);

/*#####################################################################*|

|  Arab Forums 0.2                                                      |

|  This Script Is Free Software                                         |

|  Programmed By : Aissam Nedjar                                        |

|  facebook : facebook.com/aissam.nedjar.43                             |

|*#####################################################################*/
?>